-- This script is the approach to fill the tables with some initial data

-- Tables:

-- 1. Kitchen(kitchen_id, kitchen_name)
INSERT INTO kitchen(kitchen_name) VALUES 
('Японская'),
('Грузинская'),
('Русская'),
('Китайская'),
('Американская'),
('Восточная');

SELECT * FROM kitchen;

-- 2. Officiant(officiant_id, name, hiring_date, level, phone_number, birthdate)
INSERT INTO officiant(name, hiring_date, level, phone_number, birthdate) VALUES
('Кузичкин Павел Александрович', '2019-01-01', 'Младший официант', '+79518812953', '2001-01-30'),
('Шкабура Никита Дмитриевич', '2018-06-01', 'Официант', '+79133714880', '2001-09-20'),
('Орлов Даниил Дмитриевич', '2019-03-23', 'Младший официант', '+79121231234', '2001-06-02'),
('Бурчуладзе Леван Александрович', '2021-05-09', 'Победитель', '+79999999999', '2001-03-06'),
('Сидоров Сергей Александрович', '2015-10-07', 'Старший официант', '+79909090909', '2001-07-14');

SELECT * FROM officiant;

-- 3. Discount(discount_id, start_date, end_date)
INSERT INTO discount(start_date, end_date) VALUES
('2022-05-01', '2022-05-12'),
('2022-03-01', '2022-08-01'),
('2022-08-01', '2022-11-01');

SELECT * FROM discount;

-- 4. Product(id_product, product_name, exp_time, arrivement_date, cost, supplier)
INSERT INTO product(product_name, exp_time, arrivement_date, cost, supplier) VALUES
('Мука', 30, '2022-06-13', 99, 'РосАгрономПродукт'),
('Яйцо', 7, '2022-05-21', 159, 'РосАгрономПродукт'),
('Крахмал', 365, '2023-05-14', 59, 'РосАгрономПродукт'),
('Панировочные сухари', 365, '2023-05-14', 129, 'РосКухняВкусно'),
('Креветки морские (маленькие)', 2, '2022-05-16', 459, 'МорепродуктыОтлов'),
('Креветки морские (королевские)', 3, '2022-05-17', 729, 'МорепродуктыОтлов'),
('Картофель', 15, '2022-05-29', 129, 'РосАгрономПродукт'),
('Укроп садовый', 24, '2022-06-07', 39, 'РосАгрономПродукт'),
('Куркума', 150, '2022-10-12', 59, 'РосЭкзотикаПродукт'),
('Говядина', 7, '2022-05-21', 249, 'РосАгрономПродукт'),
('Свинина', 7, '2022-05-21', 179, 'РосАгрономПродукт'),
('Курица (филе)', 10, '2022-05-24', 229, 'РосАгрономПродукт'),
('Курица (бедро)', 7, '2022-05-21', 249, 'РосАгрономПродукт'),
('Курица (целая)', 15, '2022-05-29', 529, 'РосАгрономПродукт');

SELECT * FROM product;

-- 5. Client(client_id, name, birthdate, phone_number, discount_id FK)
INSERT INTO client(name, birthdate, phone_number, discount_id) VALUES
('Гераскин Никита Константинович', '2001-10-19', '+79874783327', 3),
('Казлов Игорь Дмитриевич', '2001-05-12', '+79279937468', 2),
('Сабуров Нурлан Акселевич', '1990-03-27', '+79231111111', 1),
('Казлов Игорь Дмитриевич', '2001-05-12', '+79279937468', 3),
('Обзоров Айфон Вилсакомович', '2005-09-30', '+79174567890', 3),
('Федоров Михаил Александрович', '2001-12-23', '+79371231234', 2);

SELECT * FROM client;

-- 6. Dish(dish_id, dish_name, kitchen_id FK, cost)
INSERT INTO dish(dish_name, kitchen_id, cost) VALUES
('Креветки в темпуре', 6, 659),
('Салат с куриным филе', 3, 229),
('Куриный суп', 3, 149),
('Картофель-пюре с тушеной говядиной', 3, 169);

SELECT * FROM dish;

-- 7. Product List(id_dish FK, product_id FK, product_count, cooking_type)
INSERT INTO product_list(id_dish, product_id, product_count, cooking_type) VALUES
(1, 4, 3, 'Фритюр'),
(1, 6, 1, 'Фритюр'),
(2, 12, 1, 'Салат'),
(3, 13, 2, 'Вареное'),
(3, 8, 1, 'Вареное'),
(4, 7, 3, 'Вареное'),
(4, 10, 1, 'Вареное');

SELECT * FROM product_list;

-- 8. Offer(offer_id, offer_time, price, officiant_id FK, client_id FK)
INSERT INTO offer(offer_time, price, officiant_id, client_id) VALUES
('2022-04-24', 2467, 1, 5),
('2022-04-23', 6719, 2, 6),
('2022-03-10', 1234, 2, 1),
('2022-04-18', 2345, 1, 2),
('2022-03-20', 3456, 1, 3),
('2022-02-14', 4567, 5, 1),
('2022-04-11', 5678, 4, 6),
('2022-05-14', 6789, 5, 3),
('2022-05-11', 7890, 3, 1),
('2022-02-28', 1233, 4, 2),
('2022-04-17', 2344, 3, 5),
('2022-03-11', 3455, 1, 3),
('2022-05-03', 4566, 4, 2);

SELECT * FROM offer;

-- 9. Dish List(offer_id FK, dish_id FK)
INSERT INTO dish_list(offer_id, dish_id) VALUES
(1, 1),
(1, 2),
(2, 1),
(2, 2),
(2, 3),
(2, 4),
(3, 1),
(3, 2),
(3, 3),
(4, 1),
(4, 2),
(4, 3),
(5, 1),
(5, 2),
(5, 3),
(6, 1),
(6, 2),
(6, 3),
(6, 4),
(7, 1),
(7, 2),
(7, 3),
(7, 4),
(8, 1),
(8, 2),
(8, 3),
(9, 1),
(9, 2),
(9, 3),
(10, 1),
(10, 2),
(10, 3),
(11, 1),
(11, 2),
(12, 1),
(12, 2),
(13, 1),
(13, 2),
(13, 3);

SELECT * FROM dish_list;